from schemas.movies import Movie


MOVIES = [
    Movie(
        slug="1",
        name="Интерстеллар",
        description="Фантастический фильм о путешествии через червоточину в поисках нового дома для человечества",
        author="Кристофер Нолан",
    ),
    Movie(
        slug="2",
        name="Крестный отец",
        description="Эпическая сага о сицилийской мафиозной семье Корлеоне",
        author="Фрэнсис Форд Коппола",
    ),
    Movie(
        slug="3",
        name="Властелин колец: Братство кольца",
        description="Фэнтези о путешествии хоббита Фродо по уничтожению Кольца Всевластия",
        author="Питер Джексон",
    ),
    Movie(
        slug="4",
        name="Форрест Гамп",
        description="История жизни простого человека, ставшего свидетелем ключевых событий американской истории",
        author="Роберт Земекис",
    ),
]
